#ifndef YEBISU6_SSE2_H
#define YEBISU6_SSE2_H
//// h6-grape_sse2.h         ////
//// based on yebisu6-sse2.h ////
//// modeified for BRIDGE    ////
#include <assert.h>
// #include <omp.h>
// #include "coord.h"
#include "accum.h"
//#include "v4df.h"
//#include "v4sf.h"

//#include "nbody_particle_MPI.h"

struct Force{
    //static const int nword = 9;
    vec acc;
    vec jrk;
    vec snp;
    double phi;
    int nnb_id;
    float  nnb_r2;
    Force() : acc(0.0), jrk(0.0), snp(0.0), phi(0.0), nnb_id(-1), nnb_r2(HUGE){}    void operator += (Force &rhs){
        acc += rhs.acc;
        jrk += rhs.jrk;
        snp += rhs.snp;
        phi += rhs.phi;
    }
    void clear(){
        acc[0] = acc[1] = acc[2] = 0.0;
        jrk[0] = jrk[1] = jrk[2] = 0.0;
        snp[0] = snp[1] = snp[2] = 0.0;
        phi = 0.0;
        nnb_id = -1;
        nnb_r2 = HUGE;

    }
  //// for BH particles ////
    void add_BH_force(double eps2, double mBH, vec pos_BH, vec vel_BH, vec acc_BH,
		      vec pos_i, vec vel_i, vec acc_i, int iBH){

            vec pos0 = pos_BH - pos_i;
            vec vel0 = vel_BH - vel_i;
            vec acc0 = acc_BH - acc_i;
            double dist2 = pos0*pos0;
	    double r2 = dist2 + eps2;
            double rinv2 = 1.0 / r2;
            double rinv = sqrt(rinv2);
            double rinv3 = rinv*rinv2;

            double alpha = rinv2*(vel0*pos0);
            double beta = rinv2*(vel0*vel0 + pos0*acc0) + alpha*alpha;

            vec acc1 = mBH * rinv3 * pos0;
            vec jerk1 = mBH*rinv3*vel0 - 3.0*alpha*acc1;
            double phi1 = -mBH * rinv;

            snp += mBH*rinv3*acc0 - 6.0*alpha*jerk1 - 3.0*beta*acc1;
            acc += acc1;
            jrk += jerk1;
            phi += phi1;

            if(dist2<nnb_r2){
                nnb_id = iBH;
		nnb_r2 = dist2;
                //cout << index << endl;
            }
    }
    
};

namespace yebisu{
  //namespace grape{
	typedef double v2df __attribute__ ((vector_size(16)));
	struct predictor{
		double pos [3]; //  6
		double vel [3]; // 12
		double acc [3]; // 18
		double mass;    // 20
		double id  ;    // 22
	    //double pad [2];
	    double eps2;
		predictor(){
			assert(sizeof(*this) == 12*8);
		}
	};
	struct predictor2{
		double pos [3][2]; //  6
		double vel [3][2]; // 12
		double acc [3][2]; // 18
		double mass[2];    // 20
		double id  [2];    // 22
	    //double pad [2];
	    double eps2[2];
		predictor2(){
			assert(sizeof(*this) == 24*8);
		}
	};
	struct particle{
		double pos [3][2]; //  6
		double vel [3][2]; // 12
		double acc [3][2]; // 18
		double jrk [3][2]; // 24
		double snp [3][2]; // 30
		double crk [3][2]; // 36
		double mass[2];    // 38
		double time[2];    // 40
		double id  [2];    // 42
	    //double pad [6];    // 48
	    double eps2[2];
		particle(){
			assert(sizeof(*this) ==  44*8);
		}
	};
/*
	struct force{
		double acc[3];
		double jrk[3];
		double snp[3];
		double pot;
		int    nnb_id;
		float  nnb_r2;

		void clear(){
			acc[0] = acc[1] = acc[2] = 0.0;
			jrk[0] = jrk[1] = jrk[2] = 0.0;
			snp[0] = snp[1] = snp[2] = 0.0;
			pot = 0.0;
			nnb_id = -1;
			nnb_r2 = HUGE;
		}
	};
*/
	struct vpredictor{
		v2df pos [3]; //  6
		v2df vel [3]; // 12
		v2df acc [3]; // 18
		v2df mass;    // 20
		v2df id;      // 22
	    //v2df pad;     // 24
	    v2df eps2;
		vpredictor(){
			assert(sizeof(*this) == 24*8);
		}
	};
	struct vparticle{
		v2df pos [3]; //  6
		v2df vel [3]; // 12
		v2df acc [3]; // 18
		v2df jrk [3]; // 24
		v2df snp [3]; // 30
		v2df crk [3]; // 36
		v2df mass;    // 38
		v2df time;    // 40
		v2df id;      // 42
	    //v2df pad[3];  // 48
	    v2df eps2;
		vparticle(){
			assert(sizeof(*this) ==  44*8);
		}
	};

	class Yebisu{
	  //class Grape{
		int nbody, n;
		int n_array;
		int njblocks;
		static const int JBSIZE = 16384;
		double dtmax, invdtmax;
		particle  *ptcl;
		predictor2 *pred2;
		vparticle  *vptcl;
		vpredictor *vpred;
		//double *dtime;
		double frac_time(double t){
			t -= dtmax * int(t*invdtmax);
			return t;
		}
	public:
		//force *fobuf;
		//Yebisu(unsigned _nbody, double _dtmax) :
		//Grape(int _nbody, double _dtmax) :
		
		Yebisu(int _nbody, double _dtmax) :
			nbody(_nbody), dtmax(_dtmax)
		{
		    //assert(nbody%2 == 0);
		    nbody = _nbody;
		    n = nbody;
                    if(nbody%2 != 0){
			n++;
		    }
		    assert(n%2 == 0);
		    njblocks = n / JBSIZE + (nbody % JBSIZE ? 1 : 0);
		    invdtmax = 1./dtmax;
		    ptcl = new particle[n/2];
		    pred2 = new predictor2[n/2];
		    //fobuf = new force[nbody];			
